code/cluster/published/current/raw/2026-03-05_localhost_modern_profile_r24_full20b_localhost_vllm_serve_request_rate_sweep/repeat_3/rate_sweep_log.txt
Lowering --gpu-memory-utilization from 0.8 to 0.8000 based on free VRAM (182514 MiB / 183359 MiB).
Skipping completed request-rate point 1 (resume).
Skipping completed request-rate point 2 (resume).
Skipping completed request-rate point 4 (resume).
Skipping completed request-rate point 8 (resume).
=== Starting vLLM Server (request-rate sweep) ===
Enabling --enforce-eager for startup robustness.
Server PID: 72
Server log: /results/rate_server.log
Waiting for server to be ready...
  Waiting... (5s)
  Waiting... (10s)
  Waiting... (15s)
  Waiting... (20s)
  Waiting... (25s)
  Waiting... (30s)
  Waiting... (35s)
  Waiting... (40s)
  Waiting... (45s)
  Waiting... (50s)
  Waiting... (55s)
Server is ready!


========================================
=== Running Benchmark: Request rate 16 req/s ===
========================================
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7501e8341e40>, trust_remote_code=False, seed=0, num_prompts=300, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='vllm', base_url='http://localhost:8888', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=256, model='openai/gpt-oss-20b', input_len=1024, output_len=1024, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=16.0, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/results', result_filename='rate16_isl1024_osl1024_tp1.json', ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-e8db2137-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False)
INFO 03-05 15:31:44 [datasets.py:626] Sampling input_len from [1024, 1024] and output_len from [1024, 1024]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 16.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 256
100%|██████████| 300/300 [01:26<00:00,  3.47it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     300       
Failed requests:                         0         
Maximum request concurrency:             256       
Request rate configured (RPS):           16.00     
Benchmark duration (s):                  86.50     
Total input tokens:                      307200    
Total generated tokens:                  307200    
Request throughput (req/s):              3.47      
Output token throughput (tok/s):         3551.32   
Peak output token throughput (tok/s):    6400.00   
Peak concurrent requests:                272.00    
Total token throughput (tok/s):          7102.64   
---------------Time to First Token----------------
Mean TTFT (ms):                          123.33    
Median TTFT (ms):                        123.91    
P99 TTFT (ms):                           152.86    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          40.42     
Median TPOT (ms):                        40.24     
P99 TPOT (ms):                           41.27     
---------------Inter-token Latency----------------
Mean ITL (ms):                           40.42     
Median ITL (ms):                         40.37     
P99 ITL (ms):                            45.26     
==================================================

Results saved to:
  - /results/rate16_isl1024_osl1024_tp1.json
  - /results/rate16_bench.txt
  - /results/rate16_telemetry.csv

========================================
=== Request-rate Sweep Complete ===
========================================
========================================
vLLM Request-Rate Sweep Results
========================================
Model: openai/gpt-oss-20b
TP: 1
ISL: 1024, OSL: 1024
Max concurrency cap: 256
Num prompts: 300

Req/s | Output tok/s | Total tok/s | Mean TTFT | Mean TPOT | P99 TTFT | P99 TPOT
------|--------------|-------------|-----------|-----------|----------|----------
1.00   | 899.95       | 1799.90     | 114.12    | 40.982    | 137.83   | 42.216  
2.00   | 1595.29      | 3190.58     | 119.23    | 42.298    | 142.93   | 42.638  
4.00   | 2626.11      | 5252.23     | 123.13    | 40.695    | 147.98   | 41.127  
8.00   | 3476.82      | 6953.64     | 120.26    | 39.934    | 148.55   | 40.297  
16.00  | 3551.32      | 7102.64     | 123.33    | 40.416    | 152.86   | 41.270